# organization-shared - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=production-cockroachdb-serverless-cluster-id]
module.common_resources.module.database.cockroach_database.default: Refreshing state... [id=2539ad74-c3bc-4b10-bb6e-e55edf9e9fbf:production-organization]
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=production-kafka-cluster-id]
module.common_resources.module.kafka_topic.upstash_kafka_topic.default: Refreshing state... [id=upstash-kafka-topic-8ca36751-9a46-4912-a2e0-a6b1ecb8b759]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=production-cockroachdb-serverless-cluster-id]
module.common_resources.module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=2539ad74-c3bc-4b10-bb6e-e55edf9e9fbf:production-organization-database-migration]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "production-organization"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "production-organization_database_migration"
    }

  # module.common_resources.module.database_migration_user.cockroach_sql_user.default must be replaced
-/+ resource "cockroach_sql_user" "default" {
      ~ id         = "2539ad74-c3bc-4b10-bb6e-e55edf9e9fbf:production-organization-database-migration" -> (known after apply)
      ~ name       = "production-organization-database-migration" -> "production-organization_database_migration" # forces replacement
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_migration_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "1fdc3b50-43da-4336-bd89-47ee4387c723" -> "7e4465e4-de27-4fa5-bfa5-8a16e1c0cc99"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*